#variable that datas are 0 

from __future__ import unicode_literals
from datetime import *
import time
from hazm import *
from persiantools.jdatetime import JalaliDate
from hijri_converter import  convert
import pytz
from selenium.webdriver.common.keys import Keys
from  selenium import webdriver
import json
import requests
import sqlite3
import pandas as pd
import os

year_miladi ,year_ghamari ,year_shamsi,year= 0,0,0,0
number = 0
event_swich = 0
question_time = 0
location_swich = 0
time_swich = 0
tarikh_miladi_swich = 0
weather_num = 0
weather =0
avrage = 0
counter = 0
minute ,minute_swich= 0,0
hour,hour_swich =0, 0
religious_swich = 0
WEEK = 7
MONTH = 30
DAY = 1

#empty lists
question_event_date_list = []
final_date = []
final_type = []
final_city = []
final_time = []
event_1 = []
event = []
final_religious_time = []
question_date_list = []
question_time_list = []
question_monasebat = []
final_event = []
date_list = []
temp = ''
location = ''
api_url = ''

#final answer dic
answer = {'type': '', 'city': [], 'date': [],
'time': [], 'religious_time': [], 'calendar_type': [], 'event': [], 'api_url': '', 'result': ''}


#lists (they have problems) 
weather_key_word = ['درجه','کلوین','سلسیوس','سانتی گراد','فارنهایت','آب','اب','هوا','دما','گرم','گرما','سرد','سرما']
tempreture =['سانتی گراد ','فارنهایت','درجه','کلوین','سلسیوس','دما']
monasebat = ['مصادف','مناسبت']

#should be dataset but im not sure to use it
ghamari_dic = {
'تاسوعا'  : (9,1)
,'عاشورا'  : (10,1)
,'اربعین'  : (20,2)
,'وقف'  : (27,2)
,'پرستار'  : (5,5)
,'مادر'  : (20,6)
,'زن'  : (20,6)
,'اعتکاف'  : (13,7)
,'مرد'  : (13,7)
,'پدر'  : (13,7)
,'بعثت'  : (27,7)
,'پاسدار'  : (3,8)
,'جانباز'  : (4,8)
,'جوان'  : (11,8)
,'مستضعفان'  : (15,8)
,'رمضان'  : (1,9)
,'قدر'  : (22,9)
,'قدر'  : (20,9)
,'قدر'  : (18,9)
,'فطر'  : (1,10)
,'فطر'  : (2,10)
,'دختر'  : (1,11)
,'ازدواج'  : (1,12)
,'عرفه'  : (9,12)
,'نیایش'  : (9,12)
,'قربان'  : (10,12)
,'منا'  : (10,12)
,'غدیر'  : (18,12)
,'مباهله'  : (24,12)
,'خانواده'  : (9,12)
}
miladi_dic = {
'سال میلادی'  : (1,1)  
,'گمرک'  : (26,1)  
,'ولنتاین'  : (14,2)  
,'آب'  : (22,3) 
,'هواشناسی'  : (23,3) 
,'تئاتر'  : (27,3) 
,'بهداشت'  : (7,4) 
,'گمرک'  : (26,1) 
,'کار'  : (1,5) 
,'کارگر'  : (1,5) 
,'ماما'  : (5,5) 
,'کار'  : (1,5) 
,'تالاسمی'  : (8,5) 
,'صلیب سرخ'  : (8,5) 
,'هلال احمر'  : (8,5) 
,'موزه'  : (18,5) 
,'میراث فرهنگی'  : (18,5) 
,'دخانیات'  : (31,5) 
,'محیط زیست'  : (5,6) 
,'تالاسمی'  : (8,5) 
,'صنایع دستی'  : (10,6) 
,'بیابان زدایی'  : (17,6) 
,'مواد مخدر'  : (26,6) 
,'شیردهی'  : (1,8) 
,'هیروشیما'  : (6,8) 
,'چپ دست'  : (13,8) 
,'مساجد'  : (21,8) 
,'جهانگردی'  : (27,9) 
,'دریانوردی'  : (30,9) 
,'ناشنوایان'  : (30,9) 
,'سالمند'  : (1,10) 
,'کودک'  : (8,10) 
,'پست'  : (9,10) 
,'استاندارد'  : (14,10) 
,'تالاسمی'  : (8,5) 
,'نابینایان'  : (15,10)
,'غذا'  : (16,10)
,'پرتونگاری'  : (8,11)
,'علم'  : (10,11)
,'دیابت'  : (14,11)
,'ایدز'  : (1,12) 
,'معلولان'  : (3,12) 
,'هواپیمایی'  : (7,12) 
,'مصرف کننده'  : (9,12) 
,'عیسی مسیح'  : (25,12) 
}
shamsi_dic = {
'نوروز'  : (1,1)
,'طبیعت'  : (13,1)
,'سلامتی'  : (18,1)
,'ارتش'  : (29,1)
,'سعدی'  : (1,2)
,'شورا'  : (9,2)
,'معلم'  : (12,2)
,'مطهری'  : (12,2)
,'ارتباطات'  : (27,2)
,'جمعیت'  : (30,2)
,'مقاومت'  : (3,3)
,'خرمشهر'  : (3,3)
,'رحلت امام خمینی'  : (14,3)
,'پانزده خرداد'  : (15,3)
,'کشاورزی'  : (27,3)
,'رودبار'  : (29,3)
,'بسیج'  : (31,3)
,'شریعتی'  : (31,3)
,'چمران'  : (31,3)
,'اصناف'  : (1,4)
,'تبلیغ'  : (1,4)
,'قضائیه'  : (7,4)
,'معدن'  : (10,4)
,'قلم'  : (14,4)
,'شهرداری'  : (14,4)
,'دهیاری'  : (14,4)
,'مالیات'  : (16,4)
,'کودکان'  : (18,4)
,'نوجوانان'  : (18,4)
,'عفاف'  : (21,4)
,'حجاب'  : (21,4)
,'بهزیستی'  : (25,4)
,'تأمین'  : (25,4)
,'بهزیستی'  : (25,4)
,'خون'  : (9,5)
,'جهاد'  : (16,5)
,'خبرنگار'  : (17,5)
,'دفاعی'  : (31,5)
,'پزشک'  : (1,6)
,'کارمند'  : (4,6)
,'کشتی'  : (5,6)
,'داروسازی'  : (5,6)
,'بانکدار'  : (10,6)
,'چاپ'  : (11,6)
,'تعاون'  : (13,6)
,'سینما'  : (21,6)
,'شعر'  : (27,6)
,'شهریار'  : (27,6)
,'دفاع مقدس'  : (31,6)
,'آتش نشانی'  : (7,7)
,'اتش نشانی'  : (7,7)
,'شمس'  : (7,7)
,'دامپزشکی'  : (14,7)
,'روستا'  : (15,7)
,'عشایر'  : (15,7)
,'پارالمپیک'  : (24,7)
,'تربیت بدنی'  : (26,7)
,'ورزشی'  : (26,7)
,'صادرات'  : (29,5)
,'امار'  : (1,8)
,'آمار'  : (1,8)
,'نوجوان'  : (8,8)
,'فهمیده'  : (8,8)
,'دانش آموز'  : (13,8)
,'دانش اموز'  : (13,8)
,'پدافند'  : (8,8)
,'فرهنگ عمومی'  : (14,8)
,'کیفیت'  : (18,8)
,'سوسنگرد'  : (26,8)
,'بسیج'  : (5,9)
,'دریایی'  : (7,9)
,'مجلس'  : (10,9)
,'بیمه'  : (13,9)
,'دانشجو'  : (16,9)
,'پژوهش'  : (25,9)
,'حمل و نقل'  : (26,9)
,'رانندگان'  : (26,9)
,'وحدت'  : (27,9)
,'یلدا'  : (30,9)
,'ثبت احوال'  : (3,10)
,'بم'  : (5,10)
,'زلزله'  : (5,10)
,'پتروشیمی'  : (8,10)
,'اوکراینی'  : (18,10)
,'رفسنجانی'  : (19,10)
,'رضاشاه'  : (30,10)
,'غزه'  : (30,10)
,'دهه فجر'  : (12,11)
,'نیرو هوایی'  : (19,11)
,'پهلوی'  : (22,11)
,'طوسی'  : (5,12)
,'مهندسی'  : (5,12)
,'احسان'  : (14,12)
,'نیکوکاری'  : (14,12)
,'راهیان'  : (20,12)
,'نظامی'  : (21,12)
,'نفت'  : (29,12)
}
